brianwyld/ble_nrf52_v2/src/main.c
/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    comm_ble_disconnect();
}

/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the scheduler in the main loop after a BLE stack event has
 *          been received.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    // Dispatch to ble stack services if we want to be connected
    if (_ctx.bleConnectable)
    {
        ble_conn_params_on_ble_evt(p_ble_evt);
        comm_ble_dispatch(p_ble_evt);           // For NUS service (we are slave)
//        comm_ble_c_dispatch(p_ble_evt);       // When discovering peers for NUS client connections
    }
//    bsp_btn_ble_on_ble_evt(p_ble_evt);
    // If we are scanning then make db of remote guys be up to date
    if (ibs_is_scan_active())
    {
        ble_db_discovery_on_ble_evt(&_ctx.m_ble_db_discovery, p_ble_evt);
    }
    on_ble_evt(p_ble_evt);
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);
    // We have almost no GATTs
//    ble_enable_params.gatts_enable_params.attr_tab_size = BLE_GATTS_ATTR_TAB_SIZE_MIN;
//    ble_enable_params.common_enable_params.vs_uuid_count = 1;
    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT,
                                PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
    ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in] event  Event generated by bsp
 */
/*
static void bsp_event_handler(bsp_event_t event)
{
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
        break;

        case BSP_EVENT_DISCONNECT:
            comm_ble_disconnect();
            advertising_check_start();
            configUpdateRequest();
        break;
        case BSP_EVENT_WHITELIST_OFF:
            advertising_check_start();
        break;
            
        default:
        break;
    }
}
*/
/** @brief Function for initializing the Database Discovery Module.
 */
static void db_discovery_init(void)
{
    uint32_t err_code = ble_db_discovery_init(db_disc_handler);
    APP_ERROR_CHECK(err_code);
}

/** @brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/** Config handling
 */
// Get config from NVM into _ctx
static void configInit() {
    // HACKY - before starting configmgr, see if the config space in the flash contains a magic number
    // If so, initialise our major/minor from it
    uint32_t magic=0;
    hal_bsp_nvmRead(0, 4, (uint8_t*)&magic);
    if (magic==0x60671519) {
        _ctx.major_value = hal_bsp_nvmRead16(4);
        _ctx.minor_value = hal_bsp_nvmRead16(6);
        // set default name
        sprintf(_ctx.nameAdv, "%s_%04x_%04x", DEVICE_NAME_BASE, cfg_getMajor_Value(), cfg_getMinor_Value());
        log_warn("initialised config from production flash setup [%04x,%04x]", _ctx.major_value, _ctx.minor_value);
    }
    // Start configmgr module
    CFMgr_init();
    CFMgr_getOrAddElement(CFG_UTIL_KEY_BLE_IBEACON_MAJOR, &_ctx.major_value, sizeof(uint16_t));
    CFMgr_getOrAddElement(CFG_UTIL_KEY_BLE_IBEACON_MINOR, &_ctx.minor_value, sizeof(uint16_t));
    CFMgr_getOrAddElement(CFG_UTIL_KEY_BLE_IBEACON_PERIOD_MS, &_ctx.advertisingInterval_ms, sizeof(uint16_t));
    CFMgr_getOrAddElement(CFG_UTIL_KEY_BLE_IBEACON_TXPOWER, &_ctx.txPowerLevel, sizeof(int8_t));
    CFMgr_getOrAddElement(CFG_UTIL_KEY_BLE_IBEACON_EXTRA, &_ctx.extra_value, sizeof(uint8_t));
    CFMgr_getOrAddElement(CFG_UTIL_KEY_BLE_IBEACON_COMPANYID, &_ctx.company_id, sizeof(uint16_t));
    CFMgr_getOrAddElement(CFG_UTIL_KEY_BLE_IBEACON_NAME, &_ctx.nameAdv, DEVICE_NAME_LEN);
    CFMgr_getOrAddElement(CFG_UTIL_KEY_BLE_IBEACON_UUID, &_ctx.beacon_uuid_tab, UUID128_SIZE);
    CFMgr_getOrAddElement(CFG_UTIL_KEY_BLE_IBEACON_PASS, &_ctx.passwordTab, PASSWORD_LEN);
    log_info("config initialised [%s]", _ctx.nameAdv);
}
// Request update of NVM with new config
static void configUpdateRequest() {
    // Set flag to do it in main loop (for ble timing reasons)
    _ctx.flashWriteReq = true;
}
static void configWrite() {
    // Wrtie each value using configmgr (who checks if it has changed)
    CFMgr_setElement(CFG_UTIL_KEY_BLE_IBEACON_MAJOR, &_ctx.major_value, sizeof(uint16_t));
    CFMgr_setElement(CFG_UTIL_KEY_BLE_IBEACON_MINOR, &_ctx.minor_value, sizeof(uint16_t));
    CFMgr_setElement(CFG_UTIL_KEY_BLE_IBEACON_PERIOD_MS, &_ctx.advertisingInterval_ms, sizeof(uint16_t));
    CFMgr_setElement(CFG_UTIL_KEY_BLE_IBEACON_TXPOWER, &_ctx.txPowerLevel, sizeof(int8_t));
    CFMgr_setElement(CFG_UTIL_KEY_BLE_IBEACON_EXTRA, &_ctx.extra_value, sizeof(uint8_t));
    CFMgr_setElement(CFG_UTIL_KEY_BLE_IBEACON_COMPANYID, &_ctx.company_id, sizeof(uint16_t));
    CFMgr_setElement(CFG_UTIL_KEY_BLE_IBEACON_NAME, &_ctx.nameAdv, DEVICE_NAME_LEN);
    CFMgr_setElement(CFG_UTIL_KEY_BLE_IBEACON_UUID, &_ctx.beacon_uuid_tab, UUID128_SIZE);
    CFMgr_setElement(CFG_UTIL_KEY_BLE_IBEACON_PASS, &_ctx.passwordTab, PASSWORD_LEN);
}
/*!
* Set And Get methods
*/
int cfg_getFWMajor() {
    return FW_MAJOR;
}
int cfg_getFWMinor() {
    return FW_MINOR;
}

void cfg_setUUID(uint8_t* value)
{
    memcpy(_ctx.beacon_uuid_tab, value, UUID128_SIZE);
    configUpdateRequest();
}
 
