brianwyld/ble_nrf52_v2/src/main.c
uint8_t* cfg_getUUID( void )
{
    return _ctx.beacon_uuid_tab;
}
void cfg_setADV_IND(uint32_t value)
{
    _ctx.advertisingInterval_ms = value;
    configUpdateRequest();
}
 
uint16_t cfg_getADV_IND( void )
{
    return _ctx.advertisingInterval_ms;
}
 
void cfg_setTXPOWER_Level(int8_t level)
{
    _ctx.txPowerLevel = level;
    configUpdateRequest();
}
 
int8_t cfg_getTXPOWER_Level( void )
{
    return _ctx.txPowerLevel;
}
 
void cfg_setMinor_Value(uint16_t value)
{
    _ctx.minor_value = value;
    sprintf(_ctx.nameAdv, "%s_%04x_%04x", DEVICE_NAME_BASE, cfg_getMajor_Value(), cfg_getMinor_Value());
    configUpdateRequest();
}
 
uint16_t cfg_getMinor_Value( void )
{
    return _ctx.minor_value;
}
 
void cfg_setMajor_Value(uint16_t value)
{
    _ctx.major_value = value;
    sprintf(_ctx.nameAdv, "%s_%04x_%04x", DEVICE_NAME_BASE, cfg_getMajor_Value(), cfg_getMinor_Value());
    configUpdateRequest();
}
 
uint16_t cfg_getMajor_Value( void )
{
    return _ctx.major_value;
}
 
void cfg_resetPasswordOk()
{
   _ctx.isPasswordOK = false;
}
 
bool cfg_checkPassword( char* given )
{
    for(int i=0;i<PASSWORD_LEN;i++) {
        if (_ctx.passwordTab[i]!=given[i]) {
            _ctx.isPasswordOK = false;
            return false;
        }
    }
    _ctx.isPasswordOK = true;
    return true;
}
bool cfg_setPassword(char* oldp, char* newp) 
{
    if (cfg_checkPassword(oldp)) {
        for(int i=0;i<PASSWORD_LEN;i++) {
            _ctx.passwordTab[i]=newp[i];
        }
        configUpdateRequest();
        return true;
    }
    return false;
} 
void cfg_setCompanyID(uint16_t value)
{
    _ctx.company_id = value;
    configUpdateRequest();
}
 
uint16_t cfg_getCompanyID( void )
{
    return _ctx.company_id;
}
 
void cfg_setExtra_Value(uint8_t extra) {
    _ctx.extra_value = extra;
    configUpdateRequest();
}
uint8_t cfg_getExtra_Value() {
    return makeAdvPowerLevel();
}

// Return the 'measured power @ 1m' field value for the ibeacon
static uint8_t makeAdvPowerLevel( void )
{
    // If explciitly set (eg via AT cmd) use value 
    if (_ctx.extra_value!=0) {
        return _ctx.extra_value;
    }
    // Otherwise we use value based on tx power and battery
    uint8_t result_adv = 0;
    float battery = 0.0;
    
    // Get voltage
    hal_bsp_adc_init();
    battery = (float)hal_bsp_adc_read_u16();
    hal_bsp_adc_disable();
    battery = (battery * 3.6) / 1024.0;
 
    if(battery > 3.2)
    {
        result_adv = 0x18;
    }
    else if((battery <= 3.2) && (battery > 3.0))
    {
        result_adv = 0x10;
    }
    else if((battery <= 3.0) && (battery > 2.9))
    {
        result_adv = 0x08;
    }
    else if(battery <= 2.9)
    {
        result_adv = 0x00;
    }
    else
    {
        result_adv = 0x00;
    }
    
    // add tx power to the byte
    switch(cfg_getTXPOWER_Level())
    {
        case (int8_t)0x00: // RADIO_TXPOWER_TXPOWER_0dBm
            result_adv |= 0x00;
        break;
        
        case (int8_t)0xFC: // RADIO_TXPOWER_TXPOWER_Neg4dBm:
            result_adv |= 0x01;
        break;
        
        case (int8_t)0xF8: // RADIO_TXPOWER_TXPOWER_Neg8dBm:
            result_adv |= 0x02;
        break;
        
        case (int8_t)0xF4: // RADIO_TXPOWER_TXPOWER_Neg12dBm:
            result_adv |= 0x03;
        break;
        
        case (int8_t)0xF0: // RADIO_TXPOWER_TXPOWER_Neg16dBm:
            result_adv |= 0x04;
        break;
        
        case (int8_t)0xEC: // RADIO_TXPOWER_TXPOWER_Neg20dBm:
            result_adv |= 0x05;
        break;
        
        case (int8_t)0xD8: // RADIO_TXPOWER_TXPOWER_Neg30dBm:
            result_adv |= 0x06;
        break;
        
        case (int8_t)0x04UL: //RADIO_TXPOWER_TXPOWER_Pos4dBm:
            result_adv |= 0x07;
        break;
        
        default:
            result_adv |= 0x05;
        break;
    }
 
    return result_adv;
}
 
bool ibb_isBeaconning() {
    return _ctx.isIBeaconning;
}

void ibb_start() {
    _ctx.isIBeaconning=true;
    advertising_check_start();
}
void ibb_stop() {
    _ctx.isIBeaconning=false;
    advertising_check_start();
}

/** request a reset asap */
void app_reset_request() {
    _ctx.resetRequested = true;    
}

/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advdata_t          advdata;
    ble_advdata_t          scanrsp;
    ble_adv_modes_config_t options;
    ble_advdata_manuf_data_t manuf_specific_data; 
    ble_uuid_t m_adv_uuids[] = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};     // Advertise NUS server for at commands over NUS

    uint8_t flags = (BLE_GAP_ADV_FLAG_LE_GENERAL_DISC_MODE |
                                        BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED);
    memset(&advdata, 0, sizeof(advdata));
    memset(&scanrsp, 0, sizeof(scanrsp));
    memset(&options, 0, sizeof(options));

    manuf_specific_data.company_identifier = cfg_getCompanyID();

    _ctx.m_beacon_info[0] = _ctx.device_type;
    _ctx.m_beacon_info[1] = _ctx.adv_data_length;
    memcpy(&_ctx.m_beacon_info[2], &_ctx.beacon_uuid_tab[0], UUID128_SIZE);

    _ctx.m_beacon_info[18] = MSB_16(cfg_getMajor_Value());
    _ctx.m_beacon_info[19] = LSB_16(cfg_getMajor_Value());
    _ctx.m_beacon_info[20] = MSB_16(cfg_getMinor_Value());
    _ctx.m_beacon_info[21] = LSB_16(cfg_getMinor_Value());
    
    _ctx.m_beacon_info[22] = makeAdvPowerLevel();

    manuf_specific_data.data.p_data = (uint8_t *) (&_ctx.m_beacon_info[0]);
    manuf_specific_data.data.size   = APP_BEACON_INFO_LENGTH;
 
    // Build advertising data struct to pass into @ref ble_advertising_init.
/*
    if (ble_device_type == UART_MODULE)
    {
        advdata.name_type          = BLE_ADVDATA_FULL_NAME;
        advdata.include_appearance = false;
        advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    }
    */
    advdata.name_type             = BLE_ADVDATA_NO_NAME;
    advdata.flags                 = flags;
    advdata.p_manuf_specific_data = &manuf_specific_data;

    err_code = ble_advdata_set(&advdata, NULL);
    APP_ERROR_CHECK(err_code);
    
    // Initialize advertising parameters (used when starting advertising).
    memset(&_ctx.m_adv_params, 0, sizeof(_ctx.m_adv_params));
    _ctx.m_adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
    _ctx.m_adv_params.p_peer_addr = NULL;                             // Undirected advertisement.
    _ctx.m_adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    _ctx.m_adv_params.interval    = MSEC_TO_UNITS(cfg_getADV_IND(), UNIT_0_625_MS); //NON_CONNECTABLE_ADV_INTERVAL;
    _ctx.m_adv_params.timeout     = APP_CFG_NON_CONN_ADV_TIMEOUT;
 
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;
    scanrsp.name_type = BLE_ADVDATA_FULL_NAME;
    scanrsp.p_tx_power_level = &_ctx.txPowerLevel;

    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = MSEC_TO_UNITS(cfg_getADV_IND(), UNIT_0_625_MS);
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;
    options.ble_adv_slow_enabled = true;
    options.ble_adv_slow_interval = MSEC_TO_UNITS(APP_ADV_INTERVAL_SLOW, UNIT_0_625_MS);     //1285*1.6;
    options.ble_adv_slow_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;
 
