brianwyld/ble_nrf52_v2/src/main.c
    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}
 
 
/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
/*
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;
 
    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);
 
    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);
 
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}
*/

static uint32_t advertising_check_start()
{
    // in all cases, setup to be ready
    ble_gap_conn_sec_mode_t sec_mode;    
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    // password check has not been validated
    cfg_resetPasswordOk();
    // Change name
    sd_ble_gap_device_name_set(&sec_mode,
                               (const uint8_t *)(&_ctx.nameAdv[0]),
                                strlen(_ctx.nameAdv));
 
    // Change tx power level
    sd_ble_gap_tx_power_set(cfg_getTXPOWER_Level());
 
    advertising_init();
    conn_params_init();
    // only advertise if we want to be connectable, or we are ibeaconning, and we are NOT scanning
    if ((_ctx.bleConnectable || _ctx.isIBeaconning) && ibs_is_scan_active()==false)
    {
        return ble_advertising_start(_ctx.isIBeaconning?BLE_ADV_MODE_FAST:BLE_ADV_EVT_SLOW);
    }
    // TODO is it neccessary to stop advertising or did the init() do it?

    return 0;       // setup ok
}
 
void app_setFlashBusy() {
    _ctx.flashBusy = true;      // someone somewhere is writing to the flash
}
bool app_isFlashBusy() {
    return _ctx.flashBusy;      // they would like to know if its busy right now
}

// Callback when system events happen
static void sys_evt_handler(uint32_t evt)
{
    switch(evt)
    {
        case NRF_EVT_FLASH_OPERATION_SUCCESS:
            _ctx.flashBusy = false;
        break;
        
        case NRF_EVT_FLASH_OPERATION_ERROR:
            _ctx.flashBusy = false;         // Still finished though
        break;
        
        default:
        break;
    }
}




 
/*
static void deinit_uart_timeout_handler(void * p_context)
{
    comm_uart_deinit();
    
    //
    //examples to setup TX/RX in different mode :
    //
    //nrf_gpio_cfg_default(RX_PIN_NUMBER);
    //nrf_gpio_cfg_default(TX_PIN_NUMBER);
    //
    //nrf_gpio_cfg_output(RX_PIN_NUMBER);
    //nrf_gpio_pin_set(RX_PIN_NUMBER);
    //nrf_gpio_cfg_output(TX_PIN_NUMBER);
    //nrf_gpio_pin_set(TX_PIN_NUMBER);
    //
    //nrf_gpio_cfg_input(RX_PIN_NUMBER, GPIO_PIN_CNF_PULL_Pulldown);
    //nrf_gpio_cfg_input(TX_PIN_NUMBER, GPIO_PIN_CNF_PULL_Pulldown);
}
*/

static void system_init(void)
{            
    softdevice_sys_evt_handler_set(sys_evt_handler);
        
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);
}

static void ble_init(void) {
    uint32_t err_code = 0;
    db_discovery_init();

    ble_stack_init();

    gap_params_init();
    services_init();
    // Init adv parameters and start if required
    err_code = advertising_check_start();
    APP_ERROR_CHECK(err_code);

    //todo remove uart disabled at 10s of ibeaconning for power
    /*                    
    app_timer_create(&m_deinit_uart_delay,
                        APP_TIMER_MODE_SINGLE_SHOT,
                        deinit_uart_timeout_handler);    
        uint32_t deinit_delay = APP_TIMER_TICKS(10000, APP_TIMER_PRESCALER);//32 * 10000;          
        app_timer_start(m_deinit_uart_delay, deinit_delay, NULL);
    */
}
int main(void)
{
    system_init();
    // Init uart asap in case using for logs also
    comm_uart_init(); // REV B invert TX RX for board//

#ifdef RELEASE_BUILD
    wlog_init(-1);      // replace by 0 to get logs on uart
#else 
    wlog_init(-1);      // replace by 0 to get logs on uart
#endif
    configInit();              
   log_info("config/log init done");
    
    ble_init();
   log_info("ble system init done");
    // Tell host we are ready to rock
    comm_uart_tx((uint8_t *)"READY\r\n",7, NULL);
   log_info("waiting for commands");
    for (;;)
    {        
        if (_ctx.resetRequested)
        {
            NVIC_SystemReset();
        }
        if(_ctx.flashWriteReq)
        {
            configWrite();
            _ctx.flashWriteReq = false;
        }
        
        // Go in lowpower only if flash isn't busy
        if(!app_isFlashBusy())
        {
            power_manage();
        }
        comm_uart_tx((uint8_t *)"*",1, NULL);
    }
}
